Repository: chillichelli/oyster-swap
Catalog: src/locale/*/messages.po
Languages: es, hi, ru

source: A portion of each trade ({0}%) goes to liquidity providers as a protocol incentive.
es: Una parte de cada operación ({0} %) se paga a los proveedores de liquidez como incentivo de protocolo.
hi: प्रोटोकॉल इंसेटिव के तौर पर हर ट्रेड का एक हिस्सा ({0}%) लिक्विडिटी प्रोवाइडर्स को दिया जाता है।
ru: Процент от каждой сделки ({0}%) выплачивается поставщикам ликвидности как стандартное вознаграждение.

source: APY
es: PRA
ru: ГПД

source: Accounts created
es: Cuentas creadas
hi: अकाउंट बनाए
ru: Аккаунты созданы

source: Add Liquidity
es: Añadir liquidez
hi: लिक्विडिटी जोड़ें
ru: Добавить ликвидность

source: Adding Liquidity...
es: Añadiendo liquidez...
hi: लिक्विडिटी जोड़ी जा रही है...
ru: Добавление ликвидности...

source: Adding liquidity cancelled.
es: Adición de liquidez cancelada.
hi: लिक्विडिटी जोड़ना कैंसल किया।
ru: Добавление ликвидности отменено.

source: Address
es: Dirección
hi: पता
ru: Адрес

source: Addresses
es: Direcciones
hi: पते
ru: Адреса

source: Annual Percentage Yield
es: Porcentaje de rendimiento anual
hi: एनुअल परसेंटेज यील्ड
ru: Годовая процентная доходность

source: Approx. APY (24h)
es: PRA aproximado (24 h)
hi: अनुमानित APY (24घं)
ru: Примерная ГПД (24 ч)

source: Balance
es: Saldo
hi: बैलेंस
ru: Баланс

source: Charts
es: Gráficas
hi: चार्ट
ru: Диаграммы

source: Code
es: Código
hi: कोड
ru: Код

source: Connect
es: Conectar
hi: कनेक्ट करें
ru: Подключение

source: Connect Wallet
es: Conectar cartera
hi: वॉलेट कनेक्ट करें
ru: Подключить кошелек

source: Connect to a wallet to view your liquidity
es: Conéctese a una cartera para ver su liquidez
hi: अपनी लिक्विडिटी देखने के लिए किसी वॉलेट से कनेक्ट करें
ru: Для просмотра ликвидности подключитесь к кошельку

source: Constant Product
es: Producto constante
hi: परमानेंट प्रोडक्ट
ru: Постоянный продукт

source: Create Liquidity Pool
es: Crear fondo de liquidez
hi: लिक्विडिटी पूल बनाएं
ru: Создать пул ликвидности

source: Creating new pool...
es: Creando nuevo fondo...
hi: नया पूल बनाया जा रहा है...
ru: Создание нового пула...

source: Curve Type
es: Tipo de curva
hi: कर्व का प्रकार
ru: Тип кривой

source: Disconnected from wallet
es: Desconectado de la cartera
hi: वॉलेट से डिस्कनेक्ट किया
ru: Отключено от кошелька

source: Enter an amount
es: Introduzca un importe
hi: कोई राशि दर्ज करें
ru: Введите сумму

source: Fees
es: Comisiones
hi: फीस
ru: Комиссии

source: Fees (24h)
es: Comisiones (24 h)
hi: फीस (24घं)
ru: Комиссии (24 ч)

source: Fees (24hr)
es: Comisiones (24 h)
hi: फीस (24घं)
ru: Комиссии (24 ч)

source: Flat
es: Plana
hi: फ्लैट
ru: Фикс.

source: From
es: De
hi: से
ru: Из

source: From Token
es: De token
hi: टोकन से
ru: Из токена

source: Help
es: Ayuda
hi: सहायता
ru: Справка

source: Input
es: Entrada
hi: इनपुट
ru: Ввод

source: Insufficient {tokenName} funds
es: Fondos insuficientes en {tokenName}
hi: अपर्याप्त {tokenName} फंड
ru: Недостаточно средств в {tokenName}

source: LP Supply
es: Provisión de fondo de liquidez
hi: LP सप्लाई
ru: Резерв LP

source: LPs Trading Fee
es: Comisión de trading con fondos de liquidez
hi: LP ट्रेडिंग फीस
ru: Комиссия за торговлю LP

source: Liquidity
es: Liquidez
hi: लिक्विडिटी
ru: Ликвидность

source: Liquidity Pool
es: Fondo de liquidez
hi: लिक्विडिटी पूल
ru: Пул ликвидности

source: Liquidity Returned. Thank you for your support.
es: Liquidez restablecida. Gracias por su apoyo.
hi: लिक्विडिटी रिटर्न हुई। सपोर्ट के लिए आपका धन्यवाद।
ru: Ликвидность возвращена. Спасибо за поддержку.

source: Liquidity provider rewards
es: Premios para proveedores de liquidez
hi: लिक्विडिटी प्रोवाइडर वाले इनाम
ru: Вознаграждения для поставщиков ликвидности

source: Liquidity providers earn a fixed percentage fee on all trades proportional to their share of the pool. Fees are added to the pool, accrue in real time and can be claimed by withdrawing your liquidity.
es: Los proveedores de liquidez ganan una comisión fija en todas las operaciones en función de su parte de liquidez. Las comisiones se añaden al fondo, se acumulan en tiempo real y se pueden reclamar retirando la liquidez.
hi: लिक्विडिटी प्रोवाइडर को पूल में मौजूद उनके हिस्से के अनुपात में, सभी ट्रेड पर एक तय प्रतिशत के तौर पर अपना हिस्सा मिलता है। फीस को पूल में जोड़ा जाता हैं, रियल टाइम में उन्हें जमा किया जाता है और अपनी लिक्विडिटी को विद्ड्रॉ कर उन्हें क्लेम किया जा सकता है।
ru: Поставщики ликвидности получают фиксированную комиссию по всем сделкам пропорционально своим долям в пуле. Комиссии добавляются в пул, копятся в реальном времени и могут выводиться путем снятия внесенной ликвидности.

source: Minimum Received
es: Mínimo recibido
hi: न्यूनतम प्राप्त
ru: Макс. получено

source: Name
es: Nombre
hi: नाम
ru: Название

source: Network
es: Red
hi: नेटवर्क
ru: Сеть

source: No liquidity found
es: No se ha encontrado liquidez
hi: कोई लिक्विडिटी नहीं मिली
ru: Ликвидность не найдена

source: No liquidity found.
es: No se ha encontrado liquidez.
hi: कोई लिक्विडिटी नहीं मिली।
ru: Ликвидность не найдена.

source: Not possible
es: No es posible
hi: संभव नहीं है
ru: Невозможно выполнить

source: Off
hi: बंद
ru: Выкл.

source: On
hi: चालू
ru: Вкл.

source: Owner Trading Fee
es: Comisión de trading del titular
hi: ओनर ट्रेडिंग फीस
ru: Комиссия владельца за торговлю

source: Pair
es: Par
hi: पेयर
ru: Пара

source: Pair Address
es: Dirección del par
hi: पेयर एड्रेस
ru: Адрес пары

source: Pair Name
es: Nombre del par
hi: पेयर का नाम
ru: Название пары

source: Pair information
es: Información del par
hi: पेयर की जानकारी
ru: Информация о паре

source: Pair statistics
es: Estadísticas del par
hi: पेयर के आंकड़े
ru: Статистика пары

source: Pairs
es: Pares
hi: पेयर
ru: Пары

source: Please install solong wallet from Chrome
es: Por favor, instale la cartera Solong desde Chrome
hi: कृपया Chrome से Solong वॉलेट इंस्टॉल करें
ru: Установите кошелек Solong через Chrome

source: Please review inputs.
es: Por favor, revise los datos introducidos.
hi: कृपया इनपुट को रिव्यू करें।
ru: Проверьте вводные данные.

source: Please review transactions to approve.
es: Por favor, revise las transacciones para aprobar.
hi: मंजूरी देने के लिए ट्रांजेक्शन रिव्यू करें।
ru: Проверьте транзакции для подтверждения.

source: Please try again and approve transactions from your wallet
es: Por favor, inténtelo de nuevo y apruebe las transacciones desde su cartera
hi: कृपया फिर कोशिश करें और अपने वॉलेट से ट्रांजेक्शन को मंजूरी दें
ru: Повторите попытку и подтвердите транзакции из своего кошелька

source: Pool
es: Fondo
hi: पूल
ru: Пул

source: Pool Funded. Happy trading.
es: Fondo lleno. Feliz trading.
hi: पूल फंड किया। ट्रेडिंग का आनंद लें।
ru: Пул наполнен. Удачной торговли.

source: Pool doesn't exist.
es: El fondo no existe.
hi: पूल मौजूद नहीं है।
ru: Пул не существует.

source: Pool liquidity
es: Liquidez de fondo
hi: पूल लिक्विडिटी
ru: Ликвидность в пуле

source: Pool {tokenA}/{tokenB} doesn't exist
es: Fondo {tokenA}/{tokenB} no existe
hi: पूल {tokenA}/{tokenB} मौजूद नहीं है
ru: Пул {tokenA}/{tokenB} не существует

source: Pooled Tokens
es: Tokens en el fondo
hi: पूल किए गए टोकन
ru: Токены в пулах

source: Price
es: Precio
hi: कीमत
ru: Цена

source: Provide Liquidity
es: Proporcionar liquidez
hi: लिक्विडिटी डालें
ru: Предоставить ликвидность

source: Remove
es: Eliminar
hi: हटाएं
ru: Удалить

source: Removing Liquidity...
es: Eliminando liquidez...
hi: लिक्विडिटी हटाई जा रही है...
ru: Удаление ликвидности...

source: Removing liquidity cancelled.
es: Eliminación de liquidez cancelada.
hi: लिक्विडिटी हटाना कैंसल किया।
ru: Удаление ликвидности отменено.

source: See All
es: Ver todo
hi: सभी देखें
ru: Посмотреть все

source: Select a token
es: Seleccione un token
hi: टोकन चुनें
ru: Выберите токен

source: Share of pool
es: Parte en el fondo
hi: पूल का शेयर
ru: Доля в пуле

source: Slippage
es: Deslizamiento
hi: स्लिपेज
ru: Проскальзывание

source: Slippage Tolerance
es: Deslizamiento permitido
hi: स्लिपेज टॉलरेंस
ru: Допустимое проскальзывание

source: Solong Error
es: Error Solong
hi: Solong एरर
ru: Ошибка Solong

source: Statistics
es: Estadísticas
hi: आंंकड़े
ru: Статистика

source: Swap is unaudited software. Use at your own risk
es: Swap es un programa de terceros que usted usa bajo su propio riesgo
hi: Swap सॉफ्टवेयर को जांचा नहीं गया। अपने जोखिम पर इस्तेमाल करें
ru: Swap — это сторонняя программа, которую вы используете на свой страх и риск

source: Swap trade cancelled
es: Trading de intercambio cancelado
hi: Swap ट्रेड कैंसिल की गई
ru: Торговый обмен отменен

source: Swap trade cancelled.
es: Trading de intercambio cancelado.
hi: Swap ट्रेड कैंसिल की गई।
ru: Обмен валют отменен.

source: Symbol
es: Símbolo
hi: सिंबल
ru: Символ

source: The difference between the market price and estimated price due to trade size.
es: La diferencia entre el precio de mercado y el precio estimado debido al tamaño de la operación.
hi: ट्रेड के आकार के चलते बाजार मूल्य और अनुमानित कीमत के बीच का अंतर।
ru: Разница между рыночной ценой и расчетной ценой из-за размера сделки.

source: Time
es: Hora
hi: समय
ru: Время

source: To (Estimate)
es: A (estimado)
hi: प्रति (अनुमानित)
ru: В (расчет)

source: To Token
es: A token
hi: प्रति (टोकन)
ru: В токен

source: Toggle dark mode
es: Cambiar al modo oscuro
hi: डार्क मोड टॉगल करें
ru: Включить темный режим

source: Token information
es: Información del token
hi: टोकन की जानकारी
ru: Информация о токене

source: Top Pairs
es: Mejores pares
hi: टॉप पेयर
ru: Ведущие пары

source: Top Tokens
es: Mejores tokens
hi: टॉप टोकन
ru: Ведущие токены

source: Total Liquidity
es: Liquidez total
hi: कुल लिक्विडिटी
ru: Суммарная ликвидность

source: Trade
es: Operar
hi: ट्रेड
ru: Сделка

source: Trade executed.
es: Operación ejecutada.
hi: ट्रेड की।
ru: Сделка исполнена.

source: Transaction Settings
es: Ajustes de la transacción
hi: ट्रांजेक्शन सेटिंग
ru: Настройки транзакций

source: Transaction failed
es: Error de transacción
hi: ट्रांजेक्शन विफल
ru: Ошибка транзакции

source: Transaction failed...
es: Error de transacción...
hi: ट्रांजेक्शन विफल...
ru: Ошибка транзакции...

source: Transactions
es: Transacciones
hi: ट्रांजेक्शन
ru: Транзакции

source: Value per token
es: Valor por token
hi: मूल्य प्रति टोकन
ru: Значение по токенам

source: Volume
es: Volumen
hi: वॉल्यूम
ru: Объем

source: Volume (24h)
es: Volumen (24 h)
hi: वॉल्यूम (24घं)
ru: Объем (24 ч)

source: Volume (24hr)
es: Volumen (24 h)
hi: वॉल्यूम (24घं)
ru: Объем (24 ч)

source: Wallet
es: Cartera
hi: वॉलेट
ru: Кошелек

source: Wallet update
es: Actualizar cartera
hi: वॉलेट अपडेट
ru: Обновление кошелька

source: Withdraw Fee
es: Comisión por retiro
hi: विदड्रॉ फीस
ru: Комиссия за вывод

source: You need to have balance for all legs in the basket...
es: Necesita tener saldo para todas las operaciones en la cesta...
hi: बास्केट में मौजूद सभी चीजों के लिए आपके पास बैलेंस होना जरूरी है...
ru: Требуется баланс для всех частей сделки в корзине...

source: You transaction will revert if there is a large, unfavorable price movement before it is confirmed.
es: La transacción será retirada antes de su confirmación si se produce un cambio de precio grande y poco rentable.
hi: अगर ट्रांजेक्शन के कंफर्म होने से पहले कीमत में कोई बड़ा और नकारात्मक बदलाव होता है, तो ट्रांजेक्शन कैंसिल कर दिया जाएगा।
ru: Транзакция будет отозвана до ее подтверждения, если произойдет большое и невыгодное изменение цены.

source: Your Liquidity
es: Su liquidez
hi: आपकी लिक्विडिटी
ru: Ваша ликвидность

source: Your fees (24h)
es: Sus comisiones (24 h)
hi: आपकी फीस (24घं)
ru: Ваши комиссии (24 ч)

source: Your liquidity
es: Su liquidez
hi: आपकी लिक्विडिटी
ru: Ваша ликвидность

source: Your quantity
es: Su cantidad
hi: आपकी मात्रा
ru: Ваше количество

source: explorer
es: explorador
hi: एक्सप्लोरर
ru: обозреватель

source: per
es: por
hi: प्रति
ru: на

source: {symbolA} Address
es: Dirección de {symbolA}
hi: {symbolA} पता
ru: Адрес {symbolA}

source: {symbolB} Address
es: Dirección de {symbolB}
hi: {symbolB} पता
ru: Адрес {symbolB}

source: Swap
es: Intercambiar
